#Область СлужебныеПроцедурыИФункции

Процедура ДобавленияРеквизитовЗаказПокупателя(ЭтаФорма) Экспорт 
	
	//Добавление реквизитов 
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	РеквизитСкидка = Новый РеквизитФормы(
		"СогласованнаяСкидка",  //Имя реквизита формы
		Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(5, 2, ДопустимыйЗнак.Неотрицательный)),     //Тип
		"",               //Путь
		"Согласованная скидка"	//Заголовок
		, Истина);

	РеквизитКонтактноеЛицо = Новый РеквизитФормы(
							"ДЗ_КонтактноеЛицо",  //Имя реквизита формы
							Новый ОписаниеТипов("СправочникСсылка.ДЗ_КонтактныеЛица"),     //Тип
							"",               //Путь  (Пусто, "Объект", ИмяТЧ)
											  // например "Объект.Товары"	
							"Контактное лицо"	//Заголовок
							, Истина);

	Команда = ЭтаФорма.Команды.Добавить("ПересчитатьТаблицу"); 
	Команда.Заголовок = "Пересчитать таблицу";
	Команда.Действие = "ПересчитатьТаблицу"; 
	
	ДобавляемыеРеквизиты.Добавить(РеквизитСкидка);
	ДобавляемыеРеквизиты.Добавить(РеквизитКонтактноеЛицо);

	//Заставляем форму создать новые реквизиты
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	//Вывод реквизита на форму 
	
	НоваяГруппаФормы = ЭтаФорма.Элементы.Добавить(
								        "Скидка",
								        Тип("ГруппаФормы"),
										ЭтаФорма.Элементы.ГруппаШапкаЛево);
										
    НоваяГруппаФормы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
    НоваяГруппаФормы.Отображение  = ОтображениеОбычнойГруппы.Нет;
    НоваяГруппаФормы.ОтображатьЗаголовок = Ложь;
    НоваяГруппаФормы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	
	
	ПолеВвода = ЭтаФорма.Элементы.Добавить(
											"СогласованнаяСкидка", 
											Тип("ПолеФормы"), 
											ЭтаФорма.Элементы.Скидка);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_СогласованнаяСкидка";
	ПолеВвода.УстановитьДействие("ПриИзменении", "ПриИзмененииСогласованнаяСкидка");
	
	ПолеВвода = ЭтаФорма.Элементы.Добавить(
											"ДЗ_КонтактноеЛицо", 
											Тип("ПолеФормы"), 
											ЭтаФорма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	
	КнопкаФормы = ЭтаФорма.Элементы.Добавить(
											"ПересчитатьТаблицу",
											Тип("КнопкаФормы"),
											ЭтаФорма.Элементы.Скидка);
		
	КнопкаФормы.ИмяКоманды = "ПересчитатьТаблицу";
	КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	ЭтаФорма.Элементы.ПересчитатьТаблицу.Картинка = БиблиотекаКартинок.Обновить;
	ЭтаФорма.Элементы.ПересчитатьТаблицу.Отображение = ОтображениеКнопки.КартинкаИТекст;
	
КонецПроцедуры

Процедура ДобавленияКонтактногоЛицаПоступленияРеализация(ЭтаФорма) Экспорт 
	
	//Добавление реквизитов 
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	РеквизитКонтактноеЛицо = Новый РеквизитФормы(
							"ДЗ_КонтактноеЛицо",  //Имя реквизита формы
							Новый ОписаниеТипов("СправочникСсылка.ДЗ_КонтактныеЛица"),     //Тип
							"",               //Путь  (Пусто, "Объект", ИмяТЧ)
											  // например "Объект.Товары"	
							"Контактное лицо"	//Заголовок
							, Истина);

	ДобавляемыеРеквизиты.Добавить(РеквизитКонтактноеЛицо);

	//Заставляем форму создать новые реквизиты
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	//Вывод реквизита на форму 
	
	ПолеВвода = ЭтаФорма.Элементы.Добавить(
											"ДЗ_КонтактноеЛицо", 
											Тип("ПолеФормы"), 
											ЭтаФорма.Элементы.ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	
КонецПроцедуры

Процедура ДобавленияКонтактногоЛицаОплатыПокупателяПоставщика(ЭтаФорма) Экспорт 
	
	//Добавление реквизитов 
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	РеквизитКонтактноеЛицо = Новый РеквизитФормы(
							"ДЗ_КонтактноеЛицо",  //Имя реквизита формы
							Новый ОписаниеТипов("СправочникСсылка.ДЗ_КонтактныеЛица"),     //Тип
							"",               //Путь  (Пусто, "Объект", ИмяТЧ)
											  // например "Объект.Товары"	
							"Контактное лицо"	//Заголовок
							, Истина);

	ДобавляемыеРеквизиты.Добавить(РеквизитКонтактноеЛицо);

	//Заставляем форму создать новые реквизиты
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	//Вывод реквизита на форму 
	
	ПолеВвода = ЭтаФорма.Элементы.Вставить(
											"ДЗ_КонтактноеЛицо", 
											Тип("ПолеФормы"),
											ЭтаФорма,
											ЭтаФорма.ПодчиненныеЭлементы[3]);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	
КонецПроцедуры

#КонецОбласти